#include <stdio.h>

int main() {
    // Объявляем массив длины 7 со значениями 23, 5678, 2, 564, 365, 77, 443
    int arr[7] = {23, 5678, 2, 564, 365, 77, 443};
    // Выводим индексы ячеек массива по очереди через табуляцию
    for (int i = 0; i < 7; ++i) {
        printf("%d\t", i);
    }
    printf("\n");
    // Выводим каждое значение по очереди через табуляцию
    for (int i = 0; i < 7; ++i) {
        printf("%d\t", arr[i]);
    }
    printf("\n\n");

    // Объявляем матрицу a1 = 1 2
    //                        3 4
    int a1[2][2] = {{1, 2}, {3, 4}};
    // Объявляем матрицу b1 = 1 2
    //                        3 4
    int b1[2][2] = {{1, 2}, {3, 4}};
    // Объявляем матрицу c1 = a1 * b1 = 1 2 x 1 2
    //                                  3 4   3 4
    int c1[2][2] = { {a1[0][0] * b1[0][0] + a1[0][1] * b1[1][0], a1[0][0] * b1[0][1] + a1[0][1] * b1[1][1]},
                    {a1[1][0] * b1[0][0] + a1[1][1] * b1[1][0], a1[1][0] * b1[0][1] + a1[1][1] * b1[1][1]}};
    // Выводим матрицу c1 с табуляцией между столбцами и переносом строки между строками
    printf("%d\t%d\n%d\t%d\n\n", c1[0][0], c1[0][1], c1[1][0], c1[1][1]);

    // Объявляем матрицу a = 1 0
    //                       0 1
    int a[2][2] = {{1, 0}, {0, 1}};
    // Объявляем матрицу и = 1 0
    //                       0 1
    int b[2][2] = {{1, 0}, {0, 1}};
    // Объявляем матрицу c = a * b = 1 0 x 1 0
    //                               0 1   0 1
    int c[2][2] = { {a[0][0] * b[0][0] + a[0][1] * b[1][0], a[0][0] * b[0][1] + a[0][1] * b[1][1]},
                    {a[1][0] * b[0][0] + a[1][1] * b[1][0], a[1][0] * b[0][1] + a[1][1] * b[1][1]}};
    printf("%d\t%d\n%d\t%d\n", c[0][0], c[0][1], c[1][0], c[1][1]);
    return 0;
}